Tekla Open API Reference for Tekla Structures 2025
BasePoint.CoordinateSystemType Enumeration
 The type of the base points coordinate system.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CoordinateSystemType
Public Enumeration CoordinateSystemType
Members
Member name | Value | Description
GLOBAL | 1 |  Coordinate system in global.
WORKPLANE | 2 |  Coordinate system in work plane.
See Also
Reference
Tekla.Structures.Model Namespace